app/controllers/comments_controller.rb

SELECT  `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`commenter`, `body`, `post_id`, `created_at`, `updated_at`) VALUES ('user1', 'sknfksdnfkdnf', 1, '2017-05-03 23:41:49', '2017-05-03 23:41:49')
---
	def create
		@post = Post.find(params[:post_id])
		@commment = @post.comments.create(comment_params)