app/controllers/posts_controller.rb

INSERT INTO `posts` (`title`, `image`, `category`, `user_id`, `created_at`, `updated_at`) VALUES ('rails ', 'hi im the picture', 'trial', 1, '2017-05-03 23:28:23', '2017-05-03 23:28:23')
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save