app/controllers/users_controller.rb

INSERT INTO `users` (`password`, `username`, `created_at`, `updated_at`) VALUES ('abcde', 'dhruuv', '2017-05-01 21:41:59', '2017-05-01 21:41:59')
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save